Documents/ФормированиеБригады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>ФормированиеБригады</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Бригады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>Бригады</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ФормированиеБригады/Ext/ObjectModule.bsl
Процедура ПередУдалением(Отказ)
		  //об=Грузчик1.ПолучитьОбъект();
		  //об.Занятость=NULL;
		  //об.Записать();
		  //
		  //об=Грузчик2.ПолучитьОбъект();
		  //об.Занятость=NULL;
		  //об.Записать();
 КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	если Водитель.ПрохождениеИнструктажа=ложь тогда
		отказ=истина;
		 месадж=новый СообщениеПользователю;
		 месадж.Текст="Водитель не прошел инструктаж!";
		 месадж.Сообщить();
	 конецесли;
	 если Водитель.ДопускВрачом=ложь тогда
		отказ=истина;
		 месадж=новый СообщениеПользователю;
		 месадж.Текст="Водитель не допущен врачем!";
		 месадж.Сообщить();
	конецесли;

	
	флаг=ЛОЖЬ;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бригады.Автомобиль КАК Автомобиль,
		|	Бригады.Водитель КАК Водитель,
		|	Бригады.Грузчик1 КАК Грузчик1,
		|	Бригады.Грузчик2 КАК Грузчик2,
		|	Бригады.Регистратор.Дата КАК РегистраторДата,
		|	Бригады.Период КАК Период
		|ИЗ
		|	РегистрСведений.Бригады КАК Бригады";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Формат(ВыборкаДетальныеЗаписи.Период, "ДЛФ=Д")=Формат(Дата, "ДЛФ=Д") тогда
			
		Если ВыборкаДетальныеЗаписи.Автомобиль= Автомобиль тогда
			Отказ=Истина;
			меседж=новый СообщениеПользователю;
			меседж.Текст="Данный Автомобиль уже состоит в другой бригаде";
			меседж.Сообщить();
			Отказ=Истина;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Водитель=Водитель тогда
			Отказ=Истина;
			меседж=новый СообщениеПользователю;
			меседж.Текст="Данный Водитель уже состоит в другой бригаде";
			меседж.Сообщить();
			Отказ=Истина;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Грузчик1=Грузчик1 тогда
			Отказ=Истина;
			меседж=новый СообщениеПользователю;
			меседж.Текст="Данный Грузчик уже состоит в другой бригаде";
			меседж.Сообщить();
			Отказ=Истина;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Грузчик2=Грузчик2 тогда
			Отказ=Истина;
			меседж=новый СообщениеПользователю;
			меседж.Текст="Данный Грузчик уже состоит в другой бригаде";
			меседж.Сообщить();
			Отказ=Истина;
		КонецЕсли;
	  КонецЕсли;
	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда
		
	Движения.Бригады.Записывать = Истина;
	Движение = Движения.Бригады.Добавить();
	Движение.Период = Дата;
	Движение.Автомобиль = Автомобиль;
	Движение.НомерАвтомобиля=Автомобиль.НомерАвтомобиля;
	Движение.Водитель = Водитель;
	Движение.Грузчик1 = Грузчик1;
	Движение.Грузчик2 = Грузчик2;
	//КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
